apartmentapp/app/controllers/apartments_controller.rb

    def index
        apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

    def create
        apartment = current_user.apartments.create apartment_params
---
INSERT INTO "apartments" ("location", "address", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["location", "el cajon"], ["address", "355 Orlando Street Apt 33"], ["created_at", "2019-11-27 19:35:10.518375"], ["updated_at", "2019-11-27 19:35:10.518375"], ["user_id", 3.0]]